Emacs.org
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

* Have emacs open to a terminal by default (disabled currently)
#+begin_src emacs-lisp
;; (setq initial-buffer-choice (lambda () (term "fish")))
#+end_src

* Set babel to tangle the code correctly
#+begin_src emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)))

  (setq org-confirm-babel-evaluate nil)

#+end_src

* Have emacs put the installed package info in the correct place
#+begin_src emacs-lisp
  (setq custom-file (concat user-emacs-directory "/custom.el"))
#+end_src

* Clean Up emacs interface
#+begin_src emacs-lisp
  ;; Hide splash screen
  (setq inhibit-startup-message t)

  ;; Minimise status bar
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (tooltip-mode -1)
  (set-fringe-mode 10)
  (menu-bar-mode -1)

  ;; Set bell to not exist
  (setq ring-bell-function 'ignore)

#+end_src

* Set emacs term font
  #+begin_src emacs-lisp
  (set-face-attribute 'default nil :font "FuraCode NF")
  #+end_src

* Initialize Use-Package with the correct settings
#+begin_src emacs-lisp
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			   ("org" . "https://orgmode.org/elpa")
			   ("elpa" . "https://elpa.gnu.org/packages/")))

  ;; Download package archive contents if they aren't downloaded
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  ;; Install use-package
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))
  (require 'use-package)
  (setq use-package-always-ensure t)
#+end_src

* Install Up-To-Date Org Mode and bind keys
#+begin_src emacs-lisp
  (use-package org)

  (defun tangle-emacs-config (interactive) (org-babel-tangle-file "~/.config/emacs/Emacs.org"))

  (global-set-key (kbd "C-c t c") 'tangle-emacs-config)
  (global-set-key (kbd "C-c t b") 'org-babel-tangle)
  (global-set-key (kbd "C-c t f") 'org-babel-tangle-file)
#+end_src

* Add command log
#+begin_src emacs-lisp
  (use-package command-log-mode)
#+end_src

* Set up ivy
#+begin_src emacs-lisp
  (use-package ivy
    :diminish
    :bind (("C-s" . swiper))
    :config
    (ivy-mode 1))

  (use-package ivy-rich
    :init
    (ivy-rich-mode 1))
#+end_src

* Use Counsel for command and file search
#+begin_src emacs-lisp
  (use-package counsel
    :bind (("M-x" . counsel-M-x)
    ("C-x b" . counsel-ibuffer)
    ("C-x C-f" . counsel-find-file)
    :map minibuffer-local-map
    ("C-r" . 'counsel-minibuffer-history))
    :config
    (setq ivy-initial-inputs-alist nil))

#+end_src

* Replace builtin Modeline
#+begin_src emacs-lisp
  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :custom (doom-modeline-height 15))
 
#+end_src

* Enable line numbers for general programming buffers, but disable for shells and org-mode
#+begin_src emacs-lisp
  (column-number-mode)
  (global-display-line-numbers-mode t)

  (dolist (mode '(org-mode-hook
		  term-mode-hook
		  shell-mode-hook
		  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

* Set program source code to use rainbow parens
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

* Enable which-key to show keybinds and their commands
#+begin_src emacs-lisp

(use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3))
#+end_src  

* Install Helpful for better help information

#+begin_src emacs-lisp
  (use-package helpful
    :ensure t
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

#+end_src

* Install and set theme
#+begin_src emacs-lisp
  (use-package doom-themes)

  (load-theme 'doom-palenight t)
#+end_src

* Install Projectile for locating projects
#+begin_src emacs-lisp
  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (when (file-directory-p "~/Programming")
      (setq projectile-project-search-path '("~/Programming")))
    (setq projectile-switch-project-action #'projectile-dired))
#+end_src

* Install Magit
#+begin_src emacs-lisp
  (use-package magit
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
#+end_src

* Setup LSP-Mode for code completion and error checking
#+begin_src emacs-lisp
  (defun efs/lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode .ef/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l")
    :config
    (lsp-enable-which-key-integration t))

  ;; Setup auto completion
  (use-package company
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    :bind (:map company-active-map ("<tab>" . company-complete-selection))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))
#+end_src

* Register org templates with tempo
#+begin_src emacs-lisp
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
#+end_src
